/*Сколько существует чисел, десятичная запись которых содержит 6 цифр, 
причём все цифры различны и никакие две чётные и две нечётные цифры не стоят рядом. И при этом числа делятся на 5*/

#include <bits/stdc++.h>
using namespace std;
int main(){
	int count = 0;
	for (int i1 = 1; i1 <= 9; i1++)
	for (int i2 = 0; i2 <= 9; i2++)
	for (int i3 = 0; i3 <= 9; i3++)
	for (int i4 = 0; i4 <= 9; i4++)
	for (int i5 = 0; i5 <= 9; i5++)
	for (int i6 = 0; i6 <= 9; i6++){
		int arr[10] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
		arr[i1]++;
		arr[i2]++;
		arr[i3]++;
		arr[i4]++;
		arr[i5]++;
		arr[i6]++;
		if (arr[0] <= 1 && arr[1] <= 1 && arr[2] <= 1 && arr[3] <= 1 && arr[4] <= 1 && arr[5] <= 1 && arr[6] <= 1 && arr[7] <= 1 && arr[8] <= 1 && arr[9] <= 1){
			if ( (i1 % 2) != (i2 % 2) && (i2 % 2) != (i3 % 2) && (i3 % 2) != (i4 % 2) && (i4 % 2) != (i5 % 2) && (i5 % 2) != (i6 % 2)){
				if (i6 == 0 || i6 == 5)
					count++;
			}
		}
	}
	cout << count;
}

//ответ 1296
