/*https://inf-ege.sdamgia.ru/problem?id=40983

Георгий составляет коды из букв своего имени. Код должен состоять из 7 букв, 
и каждая буква в нём должна встречаться столько же раз, 
сколько в имени Георгий. Кроме того, одинаковые буквы в коде 
не должны стоять рядом. Сколько кодов может составить Георгий?*/

#include <bits/stdc++.h>
using namespace std;
int main(){

	// Г Е О Р Г И Й
	// 0 1 2 3 0 4 5

	int count = 0;
	for (int i0 = 0; i0 < 6; i0++)
	for (int i1 = 0; i1 < 6; i1++)
	for (int i2 = 0; i2 < 6; i2++)
	for (int i3 = 0; i3 < 6; i3++)
	for (int i4 = 0; i4 < 6; i4++)
	for (int i5 = 0; i5 < 6; i5++)
	for (int i6 = 0; i6 < 6; i6++){
		int arr[6] = {0, 0, 0, 0, 0, 0};
		arr[i0]++;
		arr[i1]++;
		arr[i2]++;
		arr[i3]++;
		arr[i4]++;
		arr[i5]++;
		arr[i6]++;
		if (arr[0] == 2 && arr[1] == 1  && arr[2] == 1 && arr[3] == 1 && arr[4] == 1 && arr[5] == 1)
			if ( (i0 == 0 && i1 != 0 && i6 != 0) || (i1 == 0 && (i0 != 0 && i2 != 0)) || (i2 == 0 && (i1 != 0 && i3 != 0)) || (i3 == 0 && (i2 != 0 && i1 != 0)) || (i4 == 0 && (i3 != 0 && i5 != 0)) || (i5 == 0 && (i4 != 0 && i6 != 0)) || (i6 == 0 && (i5 != 0 && i0 != 0)) )
				count++;
	}
	cout << count;
}

//ответ: 1800
