/*НАЧАЛО
  ПОКА нашлось (666)
    заменить(666, 2)
    заменить(222, 3)
    заменить(333, 6)
  КОНЕЦ ПОКА
КОНЕЦ

Какая строка получится в результате применения приведённой ниже программы к строке, состоящей из 120  шестёрок?*/

#include <bits/stdc++.h>
using namespace std;
int main(){
	string s = "";
	for (int i = 0; i < 120; i++)
		s = s + "6";
	while (s.find("666") != -1){
		if (s.find("666") != -1)
			s.replace(s.find("666"), 3, "2");
		if (s.find("222") != -1)
			s.replace(s.find("222"), 3, "3");
		if (s.find("333") != -1)
			s.replace(s.find("333"), 3, "6");
	}
	cout << s;
}

//Ответ: 3226
